## Plan Result (nonprod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 30 to add, 4 to change, 25 to destroy.</code></pre>

* Create
  * azurerm_virtual_network_peering.int-to-ss-env-vnet
  * azurerm_virtual_network_peering.int-to-vpn
  * azurerm_virtual_network_peering.ss-env-vnet-to-int
  * azurerm_virtual_network_peering.vpn-to-int
  * terraform_data.atlassian-flex-server[&#34;confluence&#34;]
  * terraform_data.atlassian-flex-server[&#34;crowd&#34;]
  * terraform_data.atlassian-flex-server[&#34;jira&#34;]
* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_flexible_server.atlassian-flex-server
  * azurerm_postgresql_server.atlassian-server
* Delete
  * azurerm_virtual_network_peering.int-to-ss-stg-vnet
  * azurerm_virtual_network_peering.ss-stg-vnet-to-int
* Replace
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodconfluence02-datadisk-000-20250224-222126&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodconfluence04-datadisk-000-20250224-222143&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodgluster01-datadisk-000-20250224-222240&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodgluster01-datadisk-001-20250224-222240&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodgluster02-datadisk-000-20250224-222300&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodgluster03-datadisk-000-20250224-222323&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodjira01-datadisk-000-20250224-221942&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodconfluence02-datadisk-000-20250224-222126&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodconfluence04-datadisk-000-20250224-222143&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodgluster01-datadisk-000-20250224-222240&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodgluster01-datadisk-001-20250224-222240&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodgluster02-datadisk-000-20250224-222300&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodgluster03-datadisk-000-20250224-222323&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodjira01-datadisk-000-20250224-221942&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-confluence-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-confluence-04&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-crowd-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-03&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-03&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway"
        name                              = "atlassian-nonprod-app-gateway"
      ~ tags                              = {
            "application"  = "atlassian"
          ~ "autoShutdown" = "false" -> "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
        name                            = "atlasssian-nonprod-kv"
        tags                            = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_managed_disk.data_disk["atlassiannonprodconfluence02-datadisk-000-20250224-222126"] must be replaced
-/+ resource "azurerm_managed_disk" "data_disk" {
      ~ disk_iops_read_only               = 0 -> (known after apply)
      ~ disk_iops_read_write              = 500 -> (known after apply)
      ~ disk_mbps_read_only               = 0 -> (known after apply)
      ~ disk_mbps_read_write              = 100 -> (known after apply)
      ~ disk_size_gb                      = 128 -> (known after apply)
      ~ id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodconfluence02-datadisk-000-20250224-222126" -> (known after apply)
      + logical_sector_size               = (known after apply)
      ~ max_shares                        = 0 -> (known after apply)
        name                              = "atlassiannonprodconfluence02-datadisk-000-20250224-222126"
      - on_demand_bursting_enabled        = false -> null
      ~ source_uri                        = "https://atlassiannonprod.blob.core.windows.net/atlassiannonprodconfluence02-d034fe70de2e4581affa129fb146e696/atlassiannonprodconfluence02-datadisk-000-20250224-222126.vhd" -> (known after apply)
      - storage_account_id                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Storage/storageAccounts/atlassiannonprod" -> null # forces replacement
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      ~ tier                              = "P10" -> (known after apply)
      - trusted_launch_enabled            = false -> null
      - upload_size_bytes                 = 0 -> null
        # (18 unchanged attributes hidden)
    }

  # azurerm_managed_disk.data_disk["atlassiannonprodconfluence04-datadisk-000-20250224-222143"] must be replaced
-/+ resource "azurerm_managed_disk" "data_disk" {
      ~ disk_iops_read_only               = 0 -> (known after apply)
      ~ disk_iops_read_write              = 500 -> (known after apply)
      ~ disk_mbps_read_only               = 0 -> (known after apply)
      ~ disk_mbps_read_write              = 100 -> (known after apply)
      ~ disk_size_gb                      = 128 -> (known after apply)
      ~ id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodconfluence04-datadisk-000-20250224-222143" -> (known after apply)
      + logical_sector_size               = (known after apply)
      ~ max_shares                        = 0 -> (known after apply)
        name                              = "atlassiannonprodconfluence04-datadisk-000-20250224-222143"
      - on_demand_bursting_enabled        = false -> null
      ~ source_uri                        = "https://atlassiannonprod.blob.core.windows.net/atlassiannonprodconfluence04-cc2996c39b244991a02610fdd2f013d3/atlassiannonprodconfluence04-datadisk-000-20250224-222143.vhd" -> (known after apply)
      - storage_account_id                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Storage/storageAccounts/atlassiannonprod" -> null # forces replacement
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      ~ tier                              = "P10" -> (known after apply)
      - trusted_launch_enabled            = false -> null
      - upload_size_bytes                 = 0 -> null
        # (18 unchanged attributes hidden)
    }

  # azurerm_managed_disk.data_disk["atlassiannonprodgluster01-datadisk-000-20250224-222240"] must be replaced
-/+ resource "azurerm_managed_disk" "data_disk" {
      ~ disk_iops_read_only               = 0 -> (known after apply)
      ~ disk_iops_read_write              = 7500 -> (known after apply)
      ~ disk_mbps_read_only               = 0 -> (known after apply)
      ~ disk_mbps_read_write              = 250 -> (known after apply)
      ~ disk_size_gb                      = 4000 -> (known after apply)
      ~ id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodgluster01-datadisk-000-20250224-222240" -> (known after apply)
      + logical_sector_size               = (known after apply)
      ~ max_shares                        = 0 -> (known after apply)
        name                              = "atlassiannonprodgluster01-datadisk-000-20250224-222240"
      - on_demand_bursting_enabled        = false -> null
      ~ source_uri                        = "https://atlassiannonprod.blob.core.windows.net/atlassiannonprodgluster01-c76d3ddfbca6406caea445c743914139/atlassiannonprodgluster01-datadisk-000-20250224-222240.vhd" -> (known after apply)
      - storage_account_id                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Storage/storageAccounts/atlassiannonprod" -> null # forces replacement
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      ~ tier                              = "P50" -> (known after apply)
      - trusted_launch_enabled            = false -> null
      - upload_size_bytes                 = 0 -> null
        # (18 unchanged attributes hidden)
    }

  # azurerm_managed_disk.data_disk["atlassiannonprodgluster01-datadisk-001-20250224-222240"] must be replaced
-/+ resource "azurerm_managed_disk" "data_disk" {
      ~ disk_iops_read_only               = 0 -> (known after apply)
      ~ disk_iops_read_write              = 500 -> (known after apply)
      ~ disk_mbps_read_only               = 0 -> (known after apply)
      ~ disk_mbps_read_write              = 100 -> (known after apply)
      ~ disk_size_gb                      = 1024 -> (known after apply)
      ~ id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodgluster01-datadisk-001-20250224-222240" -> (known after apply)
      + logical_sector_size               = (known after apply)
      ~ max_shares                        = 0 -> (known after apply)
        name                              = "atlassiannonprodgluster01-datadisk-001-20250224-222240"
      - on_demand_bursting_enabled        = false -> null
      ~ source_uri                        = "https://atlassiannonprod.blob.core.windows.net/atlassiannonprodgluster01-c76d3ddfbca6406caea445c743914139/atlassiannonprodgluster01-datadisk-001-20250224-222240.vhd" -> (known after apply)
      - storage_account_id                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Storage/storageAccounts/atlassiannonprod" -> null # forces replacement
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      + tier                              = (known after apply)
      - trusted_launch_enabled            = false -> null
      - upload_size_bytes                 = 0 -> null
        # (18 unchanged attributes hidden)
    }

  # azurerm_managed_disk.data_disk["atlassiannonprodgluster02-datadisk-000-20250224-222300"] must be replaced
-/+ resource "azurerm_managed_disk" "data_disk" {
      ~ disk_iops_read_only               = 0 -> (known after apply)
      ~ disk_iops_read_write              = 7500 -> (known after apply)
      ~ disk_mbps_read_only               = 0 -> (known after apply)
      ~ disk_mbps_read_write              = 250 -> (known after apply)
      ~ disk_size_gb                      = 4000 -> (known after apply)
      ~ id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodgluster02-datadisk-000-20250224-222300" -> (known after apply)
      + logical_sector_size               = (known after apply)
      ~ max_shares                        = 0 -> (known after apply)
        name                              = "atlassiannonprodgluster02-datadisk-000-20250224-222300"
      - on_demand_bursting_enabled        = false -> null
      ~ source_uri                        = "https://atlassiannonprod.blob.core.windows.net/atlassiannonprodgluster02-26e2ef77d58a4895ad7d1d8dc7b165aa/atlassiannonprodgluster02-datadisk-000-20250224-222300.vhd" -> (known after apply)
      - storage_account_id                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Storage/storageAccounts/atlassiannonprod" -> null # forces replacement
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      ~ tier                              = "P50" -> (known after apply)
      - trusted_launch_enabled            = false -> null
      - upload_size_bytes                 = 0 -> null
        # (18 unchanged attributes hidden)
    }

  # azurerm_managed_disk.data_disk["atlassiannonprodgluster03-datadisk-000-20250224-222323"] must be replaced
-/+ resource "azurerm_managed_disk" "data_disk" {
      ~ disk_iops_read_only               = 0 -> (known after apply)
      ~ disk_iops_read_write              = 7500 -> (known after apply)
      ~ disk_mbps_read_only               = 0 -> (known after apply)
      ~ disk_mbps_read_write              = 250 -> (known after apply)
      ~ disk_size_gb                      = 4000 -> (known after apply)
      ~ id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodgluster03-datadisk-000-20250224-222323" -> (known after apply)
      + logical_sector_size               = (known after apply)
      ~ max_shares                        = 0 -> (known after apply)
        name                              = "atlassiannonprodgluster03-datadisk-000-20250224-222323"
      - on_demand_bursting_enabled        = false -> null
      ~ source_uri                        = "https://atlassiannonprod.blob.core.windows.net/atlassiannonprodgluster03-354cba2472444635924a3fc539971862/atlassiannonprodgluster03-datadisk-000-20250224-222323.vhd" -> (known after apply)
      - storage_account_id                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Storage/storageAccounts/atlassiannonprod" -> null # forces replacement
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      ~ tier                              = "P50" -> (known after apply)
      - trusted_launch_enabled            = false -> null
      - upload_size_bytes                 = 0 -> null
        # (18 unchanged attributes hidden)
    }

  # azurerm_managed_disk.data_disk["atlassiannonprodjira01-datadisk-000-20250224-221942"] must be replaced
-/+ resource "azurerm_managed_disk" "data_disk" {
      ~ disk_iops_read_only               = 0 -> (known after apply)
      ~ disk_iops_read_write              = 500 -> (known after apply)
      ~ disk_mbps_read_only               = 0 -> (known after apply)
      ~ disk_mbps_read_write              = 100 -> (known after apply)
      ~ disk_size_gb                      = 100 -> (known after apply)
      ~ id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodjira01-datadisk-000-20250224-221942" -> (known after apply)
      + logical_sector_size               = (known after apply)
      ~ max_shares                        = 0 -> (known after apply)
        name                              = "atlassiannonprodjira01-datadisk-000-20250224-221942"
      - on_demand_bursting_enabled        = false -> null
      ~ source_uri                        = "https://atlassiannonprod.blob.core.windows.net/atlassiannonprodjira01-16d37c2a740040ceadeea5d44aaaa8de/atlassiannonprodjira01-datadisk-000-20250224-221942.vhd" -> (known after apply)
      - storage_account_id                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Storage/storageAccounts/atlassiannonprod" -> null # forces replacement
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      ~ tier                              = "P10" -> (known after apply)
      - trusted_launch_enabled            = false -> null
      - upload_size_bytes                 = 0 -> null
        # (18 unchanged attributes hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server" {
      ~ administrator_password        = (sensitive value)
        id                            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-nonprod-flex-server"
        name                          = "atlassian-nonprod-flex-server"
      ~ tags                          = {
            "application"  = "atlassian"
          ~ "autoShutdown" = "false" -> "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (16 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_server.atlassian-server will be updated in-place
  ~ resource "azurerm_postgresql_server" "atlassian-server" {
      ~ administrator_login_password      = (sensitive value)
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server"
        name                              = "atlassian-nonprod-server"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodconfluence02-datadisk-000-20250224-222126"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-confluence-02/dataDisks/atlassiannonprodconfluence02-datadisk-000-20250224-222126" -> (known after apply)
      ~ managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodconfluence02-datadisk-000-20250224-222126" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodconfluence04-datadisk-000-20250224-222143"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-confluence-04/dataDisks/atlassiannonprodconfluence04-datadisk-000-20250224-222143" -> (known after apply)
      ~ managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodconfluence04-datadisk-000-20250224-222143" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodgluster01-datadisk-000-20250224-222240"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-01/dataDisks/atlassiannonprodgluster01-datadisk-000-20250224-222240" -> (known after apply)
      ~ managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodgluster01-datadisk-000-20250224-222240" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodgluster01-datadisk-001-20250224-222240"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-01/dataDisks/atlassiannonprodgluster01-datadisk-001-20250224-222240" -> (known after apply)
      ~ managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodgluster01-datadisk-001-20250224-222240" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodgluster02-datadisk-000-20250224-222300"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-02/dataDisks/atlassiannonprodgluster02-datadisk-000-20250224-222300" -> (known after apply)
      ~ managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodgluster02-datadisk-000-20250224-222300" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodgluster03-datadisk-000-20250224-222323"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-03/dataDisks/atlassiannonprodgluster03-datadisk-000-20250224-222323" -> (known after apply)
      ~ managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodgluster03-datadisk-000-20250224-222323" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodjira01-datadisk-000-20250224-221942"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-01/dataDisks/atlassiannonprodjira01-datadisk-000-20250224-221942" -> (known after apply)
      ~ managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodjira01-datadisk-000-20250224-221942" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_network_peering.int-to-ss-env-vnet will be created
  + resource "azurerm_virtual_network_peering" "int-to-ss-env-vnet" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "atlassian-int-nonprod-vnet-to-ss-stg-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet"
      + resource_group_name                    = "atlassian-nonprod-rg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "atlassian-int-nonprod-vnet"
    }

  # azurerm_virtual_network_peering.int-to-ss-stg-vnet will be destroyed
  # (because azurerm_virtual_network_peering.int-to-ss-stg-vnet is not in configuration)
  - resource "azurerm_virtual_network_peering" "int-to-ss-stg-vnet" {
      - allow_forwarded_traffic                = true -> null
      - allow_gateway_transit                  = false -> null
      - allow_virtual_network_access           = true -> null
      - id                                     = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-int-nonprod-vnet/virtualNetworkPeerings/atlassian-int-nonprod-vnet-to-ss-stg-vnet" -> null
      - local_subnet_names                     = [] -> null
      - name                                   = "atlassian-int-nonprod-vnet-to-ss-stg-vnet" -> null
      - only_ipv6_peering_enabled              = false -> null
      - peer_complete_virtual_networks_enabled = true -> null
      - remote_subnet_names                    = [] -> null
      - remote_virtual_network_id              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet" -> null
      - resource_group_name                    = "atlassian-nonprod-rg" -> null
      - use_remote_gateways                    = false -> null
      - virtual_network_name                   = "atlassian-int-nonprod-vnet" -> null
    }

  # azurerm_virtual_network_peering.int-to-vpn will be created
  + resource "azurerm_virtual_network_peering" "int-to-vpn" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "atlassian-int-nonprod-vnet-to-core-infra-vnet-mgmt"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
      + resource_group_name                    = "atlassian-nonprod-rg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "atlassian-int-nonprod-vnet"
    }

  # azurerm_virtual_network_peering.ss-env-vnet-to-int will be created
  + resource "azurerm_virtual_network_peering" "ss-env-vnet-to-int" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "ss-stg-vnet-to-atlassian-int-nonprod-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-int-nonprod-vnet"
      + resource_group_name                    = "ss-stg-network-rg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "ss-stg-vnet"
    }

  # azurerm_virtual_network_peering.ss-stg-vnet-to-int will be destroyed
  # (because azurerm_virtual_network_peering.ss-stg-vnet-to-int is not in configuration)
  - resource "azurerm_virtual_network_peering" "ss-stg-vnet-to-int" {
      - allow_forwarded_traffic                = true -> null
      - allow_gateway_transit                  = false -> null
      - allow_virtual_network_access           = true -> null
      - id                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/virtualNetworkPeerings/ss-stg-vnet-to-atlassian-int-nonprod-vnet" -> null
      - local_subnet_names                     = [] -> null
      - name                                   = "ss-stg-vnet-to-atlassian-int-nonprod-vnet" -> null
      - only_ipv6_peering_enabled              = false -> null
      - peer_complete_virtual_networks_enabled = true -> null
      - remote_subnet_names                    = [] -> null
      - remote_virtual_network_id              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-int-nonprod-vnet" -> null
      - resource_group_name                    = "ss-stg-network-rg" -> null
      - use_remote_gateways                    = false -> null
      - virtual_network_name                   = "ss-stg-vnet" -> null
    }

  # azurerm_virtual_network_peering.vpn-to-int will be created
  + resource "azurerm_virtual_network_peering" "vpn-to-int" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "core-infra-vnet-mgmt-to-atlassian-int-nonprod-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-int-nonprod-vnet"
      + resource_group_name                    = "rg-mgmt"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "core-infra-vnet-mgmt"
    }

  # terraform_data.atlassian-flex-server["confluence"] will be created
  + resource "terraform_data" "atlassian-flex-server" {
      + id               = (known after apply)
      + triggers_replace = [
          + "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-nonprod-flex-server",
          + "https://atlasssian-nonprod-kv.vault.azure.net/secrets/confluence-db-nonprod-postgres-password/27dbe290bd5a4b629f8a5cc4096b33d9",
          + "https://atlasssian-nonprod-kv.vault.azure.net/secrets/confluence-db-nonprod-postgres-username/6c585d3ebb284b52822375f326a01ed1",
        ]
    }

  # terraform_data.atlassian-flex-server["crowd"] will be created
  + resource "terraform_data" "atlassian-flex-server" {
      + id               = (known after apply)
      + triggers_replace = [
          + "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-nonprod-flex-server",
          + "https://atlasssian-nonprod-kv.vault.azure.net/secrets/crowd-db-nonprod-postgres-password/e36bd17fc9a64b13b6bc74f235f3f37a",
          + "https://atlasssian-nonprod-kv.vault.azure.net/secrets/crowd-db-nonprod-postgres-username/2a6d0e45588c4fbeabcb9a14819fdde9",
        ]
    }

  # terraform_data.atlassian-flex-server["jira"] will be created
  + resource "terraform_data" "atlassian-flex-server" {
      + id               = (known after apply)
      + triggers_replace = [
          + "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-nonprod-flex-server",
          + "https://atlasssian-nonprod-kv.vault.azure.net/secrets/jira-db-nonprod-postgres-password/d43e7690b13a491c83359558c1b7f614",
          + "https://atlasssian-nonprod-kv.vault.azure.net/secrets/jira-db-nonprod-postgres-username/82c4e4a604864795979c11cde79787cf",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-confluence-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "dd7ddd8b-1f6b-bdf8-98d0-5650aebf8f10" -> (known after apply)
      ~ triggers_replace = [
          ~ "722e5651a00e32952f68ee590f389546" -> "4d11f8810ce4a7b791cd4c82dffb482c",
          ~ "fb78d505115053de8c524bd5f9abeee0" -> "bcaf700219b8a54b139d0645fb981a52",
          ~ "349f304f3bfba9f9493aabde45f5407b" -> "a1467e58a350c97457c8dc9b74e61103",
          ~ "c5a6e415430a6a019bed7b7c5484de9d" -> "6c589d283840fb2d17f77b3cbea239cb",
          ~ "53ec607992d0d8c1390666080cd63809" -> "70bb3fa43763974e4507760f52b5b613",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-confluence-04"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "63d700ef-91f6-1477-7222-2ddee9a4d200" -> (known after apply)
      ~ triggers_replace = [
          ~ "722e5651a00e32952f68ee590f389546" -> "4d11f8810ce4a7b791cd4c82dffb482c",
          ~ "fb78d505115053de8c524bd5f9abeee0" -> "bcaf700219b8a54b139d0645fb981a52",
          ~ "349f304f3bfba9f9493aabde45f5407b" -> "a1467e58a350c97457c8dc9b74e61103",
          ~ "c5a6e415430a6a019bed7b7c5484de9d" -> "6c589d283840fb2d17f77b3cbea239cb",
          ~ "53ec607992d0d8c1390666080cd63809" -> "70bb3fa43763974e4507760f52b5b613",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-crowd-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "8a85ced8-44cd-ae89-355c-cb27018306dd" -> (known after apply)
      ~ triggers_replace = [
          ~ "722e5651a00e32952f68ee590f389546" -> "4d11f8810ce4a7b791cd4c82dffb482c",
          ~ "fb78d505115053de8c524bd5f9abeee0" -> "bcaf700219b8a54b139d0645fb981a52",
          ~ "349f304f3bfba9f9493aabde45f5407b" -> "a1467e58a350c97457c8dc9b74e61103",
          ~ "c5a6e415430a6a019bed7b7c5484de9d" -> "6c589d283840fb2d17f77b3cbea239cb",
          ~ "53ec607992d0d8c1390666080cd63809" -> "70bb3fa43763974e4507760f52b5b613",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "12b71cb8-3813-10a6-97df-f80be070da57" -> (known after apply)
      ~ triggers_replace = [
          ~ "722e5651a00e32952f68ee590f389546" -> "4d11f8810ce4a7b791cd4c82dffb482c",
          ~ "fb78d505115053de8c524bd5f9abeee0" -> "bcaf700219b8a54b139d0645fb981a52",
          ~ "349f304f3bfba9f9493aabde45f5407b" -> "a1467e58a350c97457c8dc9b74e61103",
          ~ "c5a6e415430a6a019bed7b7c5484de9d" -> "6c589d283840fb2d17f77b3cbea239cb",
          ~ "53ec607992d0d8c1390666080cd63809" -> "70bb3fa43763974e4507760f52b5b613",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "d8100712-17ca-0f79-e571-a17496d46a98" -> (known after apply)
      ~ triggers_replace = [
          ~ "722e5651a00e32952f68ee590f389546" -> "4d11f8810ce4a7b791cd4c82dffb482c",
          ~ "fb78d505115053de8c524bd5f9abeee0" -> "bcaf700219b8a54b139d0645fb981a52",
          ~ "349f304f3bfba9f9493aabde45f5407b" -> "a1467e58a350c97457c8dc9b74e61103",
          ~ "c5a6e415430a6a019bed7b7c5484de9d" -> "6c589d283840fb2d17f77b3cbea239cb",
          ~ "53ec607992d0d8c1390666080cd63809" -> "70bb3fa43763974e4507760f52b5b613",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "43929d9a-5f54-9440-561d-d9b111c88c4d" -> (known after apply)
      ~ triggers_replace = [
          ~ "722e5651a00e32952f68ee590f389546" -> "4d11f8810ce4a7b791cd4c82dffb482c",
          ~ "fb78d505115053de8c524bd5f9abeee0" -> "bcaf700219b8a54b139d0645fb981a52",
          ~ "349f304f3bfba9f9493aabde45f5407b" -> "a1467e58a350c97457c8dc9b74e61103",
          ~ "c5a6e415430a6a019bed7b7c5484de9d" -> "6c589d283840fb2d17f77b3cbea239cb",
          ~ "53ec607992d0d8c1390666080cd63809" -> "70bb3fa43763974e4507760f52b5b613",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "ca487044-2a06-b13a-2cf4-290224c444bc" -> (known after apply)
      ~ triggers_replace = [
          ~ "722e5651a00e32952f68ee590f389546" -> "4d11f8810ce4a7b791cd4c82dffb482c",
          ~ "fb78d505115053de8c524bd5f9abeee0" -> "bcaf700219b8a54b139d0645fb981a52",
          ~ "349f304f3bfba9f9493aabde45f5407b" -> "a1467e58a350c97457c8dc9b74e61103",
          ~ "c5a6e415430a6a019bed7b7c5484de9d" -> "6c589d283840fb2d17f77b3cbea239cb",
          ~ "53ec607992d0d8c1390666080cd63809" -> "70bb3fa43763974e4507760f52b5b613",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "901591b0-f247-7ba2-d8ca-3177896d844d" -> (known after apply)
      ~ triggers_replace = [
          ~ "722e5651a00e32952f68ee590f389546" -> "4d11f8810ce4a7b791cd4c82dffb482c",
          ~ "fb78d505115053de8c524bd5f9abeee0" -> "bcaf700219b8a54b139d0645fb981a52",
          ~ "349f304f3bfba9f9493aabde45f5407b" -> "a1467e58a350c97457c8dc9b74e61103",
          ~ "c5a6e415430a6a019bed7b7c5484de9d" -> "6c589d283840fb2d17f77b3cbea239cb",
          ~ "53ec607992d0d8c1390666080cd63809" -> "70bb3fa43763974e4507760f52b5b613",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "f962219e-d4a8-2071-a1be-32573b9bf065" -> (known after apply)
      ~ triggers_replace = [
          ~ "722e5651a00e32952f68ee590f389546" -> "4d11f8810ce4a7b791cd4c82dffb482c",
          ~ "fb78d505115053de8c524bd5f9abeee0" -> "bcaf700219b8a54b139d0645fb981a52",
          ~ "349f304f3bfba9f9493aabde45f5407b" -> "a1467e58a350c97457c8dc9b74e61103",
          ~ "c5a6e415430a6a019bed7b7c5484de9d" -> "6c589d283840fb2d17f77b3cbea239cb",
          ~ "53ec607992d0d8c1390666080cd63809" -> "70bb3fa43763974e4507760f52b5b613",
        ]
    }

Plan: 30 to add, 4 to change, 25 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":63,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->